cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    emptyWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       99;
    }
    ends
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       499;
    }
)

// ************************************************************************* //
